app/models/user.rb

  def self.find_by_credentials(cred, pass)
    @user = User.find_by(username: cred) || User.find_by(email: cred)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "usr"], ["LIMIT", 1]]