discourse/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "usr"], ["LIMIT", 1]]
---
    def find_by_credentials(cred, pass)
        @user = User.find_by(username: cred) || User.find_by(email: cred)

SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def generate_unique_session_token
        token = SecureRandom.base64

        token = SecureRandom.base64 while User.find_by(session_token: token)